# Cleaning and Analyzing the dataset
### Starting with Task 1: cleaning and validating the salary data

In [8]:
# importing pandas

import pandas as pd

In [16]:
# to read the data in the CSV file

salaries_df = pd.read_csv(r"C:\Users\Hp PROBooK\Downloads\ds_salaries_dirty.csv")

### we'll start by viewing the info of the dataset

In [50]:
# shows the info of the dataframe

salaries_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         100 non-null    int64
 1   experience_level  90 non-null     object
 2   employment_type   92 non-null     object
 3   job_title         100 non-null    object
 4   salary_in_usd     96 non-null     float64
 5   remote_ratio      100 non-null    int64
 6   company_location  94 non-null     object
 7   company_size      100 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 6.4+ KB

In [54]:
# to check the dimension of the dataframe
# this shows there are 100 rows and 8 columns

salaries_df.shape

(100, 8)

In [14]:
# to view the first 5 rows

salaries_df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2022,SE,CT,Data Scientist,42183.0,50,IN,L
1,2023,MI,FL,Data Scientist,190371.0,100,IN,S
2,2020,MI,CT,DS,173946.0,50,IN,L
3,2022,NaN,FT,ML Engineer,146336.0,50,DE,S
4,2022,MI,FL,ML Engineer,9999999.0,100,NG,L

## now proceeding with cleaning the data by applying the rules that were given

### Starting with work_year

In [35]:
# to check the data type of work_year

salaries_df['work_year'].dtypes

dtype('int64')

#### from the result, work_year is an integer (int64)
#### proceeding to check if any year was missing

In [45]:
# this checks if there is any missing year

salaries_df['work_year'].isna().value_counts()

work_year
False    100
Name: count, dtype: int64

##### value_counts returns false for the 100 rows, hence no year is missing

### Proceeding to experience_level

In [107]:
# this shows the info of the experience_level column

salaries_df['experience_level'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 100 entries, 0 to 99
Series name: experience_level
Non-Null Count  Dtype
--------------  -----
100 non-null    object
dtypes: object(1)
memory usage: 932.0+ bytes

In [111]:
# to convert the field into categorical

salaries_df['experience_level'] = salaries_df['experience_level'].astype('category')

In [117]:
# this shows the dtype of experience_level is now category

salaries_df['experience_level'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 100 entries, 0 to 99
Series name: experience_level
Non-Null Count  Dtype
--------------  -----
100 non-null    category
dtypes: category(1)
memory usage: 436.0 bytes

#### to check if experience_level has missing values

In [68]:
# to check the value counts for experience_level

salaries_df['experience_level'].value_counts()

experience_level
SE    28
EN    23
EX    21
MI    18
Name: count, dtype: int64

In [70]:
# to check the total no of rows by chaining sum

salaries_df['experience_level'].value_counts().sum()

90

#### it returns 90 rows but it should be 100 rows hence 10 rows are missing and this can be confirmed further by using isna()

In [77]:
# True shows there are 10 Nan values, False shows there are 90 accurate values

salaries_df['experience_level'].isna().value_counts()

experience_level
False    90
True     10
Name: count, dtype: int64

##### Another way to verify

In [84]:
# this shows there are 10 Nan values/ missing values

salaries_df['experience_level'].isna().sum()

10

#### to replace missing values with 'EN'

In [90]:
# fills missing values with 'EN'

salaries_df['experience_level'] = salaries_df['experience_level'].fillna('EN')

##### to confirm the missing values have been replaced

In [122]:
# this checks the number of Nan values
# since the result is 0, there are no missing values

salaries_df['experience_level'].isna().sum()

0

### Proceeding to the employment_type

##### to check the dtype of employment_type

In [130]:
# this shows the dtype of employment_type is an object

salaries_df['employment_type'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 100 entries, 0 to 99
Series name: employment_type
Non-Null Count  Dtype
--------------  -----
92 non-null     object
dtypes: object(1)
memory usage: 932.0+ bytes

In [132]:
salaries_df['employment_type'] = salaries_df['employment_type'].astype('category')

In [136]:
# to confirm the dtype is now a category

salaries_df['employment_type'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 100 entries, 0 to 99
Series name: employment_type
Non-Null Count  Dtype
--------------  -----
92 non-null     category
dtypes: category(1)
memory usage: 436.0 bytes

#### to check if there are missing values

In [145]:
# unique() shows the values 'CT', 'FL', 'FT', 'PT', NaN

salaries_df['employment_type'].unique()

['CT', 'FL', 'FT', 'PT', NaN]
Categories (4, object): ['CT', 'FL', 'FT', 'PT']

In [149]:
# this further confirms there are 8 null values

salaries_df['employment_type'].isna().value_counts()

employment_type
False    92
True      8
Name: count, dtype: int64

#### And this confirms there are 8 missing values

In [152]:
salaries_df['employment_type'].isna().sum()

8

#### to clean the missing values as required by replacing with 'FT'

In [161]:
# Fills the missing values with 'FT'

salaries_df['employment_type'] = salaries_df['employment_type'].fillna('FT')

#### to confirm there are no missing employment_types values

In [174]:
# this shows there are zero NaN values

salaries_df['employment_type'].isna().sum()

0

In [176]:
# it no longer inclues NaN values

salaries_df['employment_type'].unique()

['CT', 'FL', 'FT', 'PT']
Categories (4, object): ['CT', 'FL', 'FT', 'PT']

### Proceeding to the job_title

In [184]:
# this shows the dtype of job_title is object which is also string

salaries_df['job_title'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 100 entries, 0 to 99
Series name: job_title
Non-Null Count  Dtype
--------------  -----
100 non-null    object
dtypes: object(1)
memory usage: 932.0+ bytes

##### To remove entries with less than 3 characters
##### - first step is to confirm if there are entries with less than 3 characters

In [191]:
# to check if there are entries with less than 3 characters

salaries_df['job_title'].value_counts()

job_title
AI Specialist     32
Data Analyst      24
Data Scientist    21
ML Engineer       18
DS                 5
Name: count, dtype: int64

##### - value_counts() shows that there are entries with 'DS', this would probably mean data scientist but there is no room for assumption hence we shall  proceed to remove the 5 entries with 'DS'

In [196]:
# this code assigns right to left, by checking length of job_title and ensuring it is greater than 3

salaries_df = salaries_df[salaries_df['job_title'].str.len() > 3]

#### -we now have 95 rows as opposed to the 100 rows we started with due to the 5 rows that have been dropped

In [198]:
salaries_df

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2022,SE,CT,Data Scientist,42183.0,50,IN,L
1,2023,MI,FL,Data Scientist,190371.0,100,IN,S
3,2022,EN,FT,ML Engineer,146336.0,50,DE,S
4,2022,MI,FL,ML Engineer,9999999.0,100,NG,L
5,2023,MI,FT,Data Scientist,35539.0,50,GB,S
...,...,...,...,...,...,...,...,...
95,2021,EN,FL,AI Specialist,246386.0,50,GB,M
96,2021,MI,PT,AI Specialist,56641.0,0,US,M
97,2023,EX,CT,ML Engineer,195656.0,0,NaN,M
98,2021,EN,FT,AI Specialist,193817.0,0,NG,S
99,2020,SE,FL,Data Scientist,184165.0,0,US,L

### Proceeding to salary_in_usd

##### - the first criteria is that it is numeric, to check this

In [339]:
salaries_df['salary_in_usd'].info()

<class 'pandas.core.series.Series'>
Index: 95 entries, 0 to 99
Series name: salary_in_usd
Non-Null Count  Dtype
--------------  -----
91 non-null     float64
dtypes: float64(1)
memory usage: 1.5 KB

#### -this shows there are missing values

In [354]:
salaries_df['salary_in_usd'].isna().sum()

4

In [361]:
# fills the missing values with the median

salaries_df['salary_in_usd'] = salaries_df['salary_in_usd'].fillna(salaries_df['salary_in_usd'].median())

In [365]:
# there are no longer missing values

salaries_df['salary_in_usd'].isna().sum()

0

##### - the dtype shows that it is a float, hence numeric.

##### - the second criteria is to replace any values below 100000 or above 1,000,000 with median.

In [226]:
# this shows that three entries fall under this category

salaries_df[(salaries_df.salary_in_usd < 10000) | (salaries_df.salary_in_usd > 1000000)]

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
4,154019,MI,FL,ML Engineer,9999999.0,100,NG,L
9,154019,SE,FT,ML Engineer,5000000.0,100,IN,M
48,154019,EN,FT,AI Specialist,50.0,50,DE,L

In [228]:
salaries_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 95 entries, 0 to 99
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         95 non-null     int64
 1   experience_level  95 non-null     category
 2   employment_type   95 non-null     category
 3   job_title         95 non-null     object
 4   salary_in_usd     91 non-null     float64
 5   remote_ratio      95 non-null     int64
 6   company_location  90 non-null     object
 7   company_size      95 non-null     object
dtypes: category(2), float64(1), int64(2), object(3)
memory usage: 5.8+ KB

In [238]:
# to replace values below 10000 or above 10000000 with median

salaries_df[(salaries_df.salary_in_usd < 10000) | (salaries_df.salary_in_usd > 1000000)] = salaries_df.salary_in_usd.median()

In [240]:
# we can confirm that the salary at the index 4 has been replaced by the median

salaries_df

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2022,SE,CT,Data Scientist,42183.0,50,IN,L
1,2023,MI,FL,Data Scientist,190371.0,100,IN,S
3,2022,EN,FT,ML Engineer,146336.0,50,DE,S
4,154019,MI,FL,ML Engineer,154019.0,100,NG,L
5,2023,MI,FT,Data Scientist,35539.0,50,GB,S
...,...,...,...,...,...,...,...,...
95,2021,EN,FL,AI Specialist,246386.0,50,GB,M
96,2021,MI,PT,AI Specialist,56641.0,0,US,M
97,2023,EX,CT,ML Engineer,195656.0,0,NaN,M
98,2021,EN,FT,AI Specialist,193817.0,0,NG,S
99,2020,SE,FL,Data Scientist,184165.0,0,US,L

### Proceeding to company_location

#### this shows that they are two letter country code and nan is also included

In [252]:
salaries_df['company_location'].unique()

array(['IN', 'DE', 'NG', 'GB', nan, 'US'], dtype=object)

In [256]:
# this shows that there 5 missing values

salaries_df['company_location'].isna().value_counts()

company_location
False    90
True      5
Name: count, dtype: int64

#### to replace the nan values

In [259]:
salaries_df['company_location'] = salaries_df['company_location'].fillna('US')

In [261]:
# the nan values have been replaced by 'US'

salaries_df['company_location'].isna().value_counts()

company_location
False    95
Name: count, dtype: int64

### Proceeding to company_size

In [272]:
salaries_df['company_size'].unique()

array(['L', 'S', 'XL', 'M'], dtype=object)

##### -this shows that there are no nan values

In [282]:
# this further confirms there are no missing values

salaries_df['company_size'].isna().sum()

0

#### but we are told there are 'S', 'M', 'L' but value_counts() returns XL as well

In [285]:
salaries_df['company_size'].value_counts()

company_size
S     35
L     30
M     26
XL     4
Name: count, dtype: int64

##### -this makes 'XL' invalid hence we have to replace it with 'M'

In [304]:
valid_sizes = ['S', 'M', 'L']

salaries_df.loc[~salaries_df['company_size'].isin(valid_sizes), 'company_size'] = 'M'

#### this shows that 'XL has now been replaced with 'M''

In [309]:
salaries_df['company_size'].value_counts()

company_size
S    35
L    30
M    30
Name: count, dtype: int64

### Task 1 output

In [368]:
salaries_df.dtypes

work_year             object
experience_level    category
employment_type     category
job_title             object
salary_in_usd        float64
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [370]:
# this shows there are no missing values in any of the columns

salaries_df.isna().sum()

work_year           0
experience_level    0
employment_type     0
job_title           0
salary_in_usd       0
remote_ratio        0
company_location    0
company_size        0
dtype: int64

In [372]:
salaries_df.shape

(95, 8)

In [374]:
# output is a dataframe named clean_salaries

clean_salaries = salaries_df

In [376]:
clean_salaries

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2022,SE,CT,Data Scientist,42183.0,50,IN,L
1,2023,MI,FL,Data Scientist,190371.0,100,IN,S
3,2022,EN,FT,ML Engineer,146336.0,50,DE,S
4,154019,MI,FL,ML Engineer,154019.0,100,NG,L
5,2023,MI,FT,Data Scientist,35539.0,50,GB,S
...,...,...,...,...,...,...,...,...
95,2021,EN,FL,AI Specialist,246386.0,50,GB,M
96,2021,MI,PT,AI Specialist,56641.0,0,US,M
97,2023,EX,CT,ML Engineer,195656.0,0,US,M
98,2021,EN,FT,AI Specialist,193817.0,0,NG,S
99,2020,SE,FL,Data Scientist,184165.0,0,US,L

### Task 2: Salary trends by experience

In [507]:
# Group the data by experience_level and employment_type

salary_trends = clean_salaries.groupby(['experience_level', 'employment_type'])[['salary_in_usd']]

C:\Users\Hp PROBooK\AppData\Local\Temp\ipykernel_4156\2439208298.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  salary_trends = clean_salaries.groupby(['experience_level', 'employment_type'])[['salary_in_usd']]

In [509]:
# Computing average salary_in_usd.

salary_trends = salary_trends.mean()

In [511]:
salary_trends

                                  salary_in_usd
experience_level employment_type
EN               CT                92424.000000
                 FL               160093.333333
                 FT               132732.444444
                 PT               164922.714286
EX               CT               166817.200000
                 FL               163361.250000
                 FT               175002.625000
                 PT               111243.000000
MI               CT               170696.750000
                 FL               128410.250000
                 FT               116323.750000
                 PT               131637.750000
SE               CT               127803.833333
                 FL               129452.750000
                 FT               140414.818182
                 PT               170817.666667

## Observations

### Entry - Level (EN)

In [530]:
salary_trends.loc['EN'].round()

                 salary_in_usd
employment_type
CT                     92424.0
FL                    160093.0
FT                    132732.0
PT                    164923.0

#### -Freelance and part-time roles pay more on average than full-time and contract roles.

#### -This could suggest that some high-paying short-term or specialized gigs are available for beginners.

#### -Alternatively, these higher numbers may be due to fewer data points (less frequent job types), skewing the average.

### Mid-Level (MI)

In [532]:
salary_trends.loc['MI'].round()

                 salary_in_usd
employment_type
CT                    170697.0
FL                    128410.0
FT                    116324.0
PT                    131638.0

#### Contract roles stand out with the highest average salary, this could mean, high-paying project work.

#### Freelance and part-time roles also pay slightly more than full-time on average.

### Senior-Level (SE)

In [534]:
salary_trends.loc['SE'].round()

                 salary_in_usd
employment_type
CT                    127804.0
FL                    129453.0
FT                    140415.0
PT                    170818.0

#### Part-time roles pay the most here, which is unusual might be due to an outlier.

#### Suggests that senior-level professionals may charge premium hourly/consulting rates even for part-time involvement.

#### Full-time still pays well, and higher than freelance/contract overall

### Executive-Level (EX)

In [536]:
salary_trends.loc['EX'].round()

                 salary_in_usd
employment_type
CT                    166817.0
FL                    163361.0
FT                    175003.0
PT                    111243.0

#### Full-time employment provides the highest average salary, as expected.

#### Part-time is significantly lower, perhaps due to fewer hours or transitional executive roles.

#### Freelance and contract remain competitive, showing that experienced professionals are valuable even outside full-time roles.

### Conclusion

#### Across all experience levels, contract and part-time roles often show surprisingly high averages.

#### Freelance roles consistently pay well across levels, suggesting that independence can be financially rewarding.

#### Full-time salaries increase predictably with experience, except in the entry level, where part-time/freelance appears to skew higher — possibly due to an outlier

### Average salary in USD

In [538]:
average_salary_in_usd = salary_trends['salary_in_usd'].mean()

In [543]:
print(f'The average Salary in USD is {round(average_salary_in_usd)} USD')

The average Salary in USD is 142635 USD

## Task 3: Remote Work Analysis

In [552]:
# Remote jobs only
remote_jobs = clean_salaries[clean_salaries['remote_ratio'] == 100]

In [556]:
remote_jobs

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
1,2023,MI,FL,Data Scientist,190371.0,100,IN,S
4,154019,MI,FL,ML Engineer,154019.0,100,NG,L
6,M,EN,FL,AI Specialist,214423.0,100,DE,M
9,154019,SE,FT,ML Engineer,154019.0,100,IN,M
16,2023,EN,FL,Data Analyst,51357.0,100,GB,S
18,2023,EX,FT,Data Analyst,107505.0,100,IN,L
21,2020,EN,CT,Data Scientist,80108.0,100,IN,M
23,2023,SE,FL,ML Engineer,124179.0,100,GB,L
28,2023,EX,FT,AI Specialist,247903.0,100,GB,L
34,2021,SE,FT,ML Engineer,116416.0,100,IN,S
35,2020,EN,FL,AI Specialist,100271.0,100,NG,L
36,2023,EN,PT,Data Scientist,74064.0,100,GB,S
39,2022,EN,FL,AI Specialist,201890.0,100,DE,M
42,2021,EX,FL,Data Analyst,178501.0,100,GB,L
45,2023,SE,PT,Data Analyst,240981.0,100,US,L
55,2023,MI,CT,Data Analyst,84045.0,100,GB,S
57,2020,MI,PT,AI Specialist,200862.0,100,NG,M
62,2020,EX,FT,Data Scientist,235615.0,100,IN,S
66,2023,EX,FL,ML Engineer,139616.0,100,US,M
67,2020,SE,FL,ML Engineer,135983.0,100,GB,S
68,2023,EN,CT,Data Analyst,154019.0,100,IN,S
73,2021,EX,FL,AI Specialist,112989.0,100,DE,S
75,2021,MI,FL,AI Specialist,73525.0,100,NG,S
76,2023,SE,FT,AI Specialist,208274.0,100,GB,L
78,2022,EN,FT,ML Engineer,93208.0,100,GB,S
84,2022,EN,PT,Data Scientist,206308.0,100,IN,M
85,2022,EN,CT,AI Specialist,145294.0,100,IN,L
92,2021,EN,FT,AI Specialist,36102.0,100,US,L

In [558]:

# On-site jobs only
onsite_jobs = clean_salaries[clean_salaries['remote_ratio'] == 0]

In [560]:
onsite_jobs

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
13,2022,MI,CT,Data Analyst,163272.0,0,NG,L
14,2023,SE,CT,Data Analyst,229569.0,0,IN,L
19,2022,EN,CT,ML Engineer,32869.0,0,NG,S
25,2021,EX,PT,ML Engineer,68467.0,0,NG,L
26,2021,MI,FT,Data Analyst,53328.0,0,GB,S
29,2023,EX,FT,AI Specialist,165059.0,0,GB,S
30,2020,EX,PT,Data Scientist,154019.0,0,DE,L
31,M,EN,FL,Data Scientist,183471.0,0,GB,M
43,2023,EX,FT,ML Engineer,167965.0,0,DE,M
47,2022,EN,FT,AI Specialist,164508.0,0,IN,S
52,2022,EN,FL,Data Scientist,60746.0,0,DE,S
58,2022,EN,FL,Data Scientist,137455.0,0,IN,L
59,2020,EX,FT,Data Analyst,166672.0,0,IN,M
60,2022,SE,FT,AI Specialist,154019.0,0,NG,S
61,2022,EN,PT,Data Scientist,201836.0,0,GB,M
64,M,MI,CT,Data Analyst,217907.0,0,GB,M
69,2021,MI,CT,Data Analyst,217563.0,0,GB,S
74,2020,EX,FT,Data Scientist,66212.0,0,US,M
80,2022,EN,FL,AI Specialist,179783.0,0,DE,M
82,2020,MI,PT,AI Specialist,126752.0,0,NG,L
86,2021,MI,FT,Data Analyst,227307.0,0,US,L
87,2020,SE,FT,Data Analyst,215312.0,0,NG,M
88,2023,SE,FT,Data Scientist,154019.0,0,GB,M
96,2021,MI,PT,AI Specialist,56641.0,0,US,M
97,2023,EX,CT,ML Engineer,195656.0,0,US,M
98,2021,EN,FT,AI Specialist,193817.0,0,NG,S
99,2020,SE,FL,Data Scientist,184165.0,0,US,L

In [562]:
# average salary for remote and on-site
remote_avg = remote_jobs['salary_in_usd'].mean()

onsite_avg = onsite_jobs['salary_in_usd'].mean()

In [564]:
remote_avg

145065.9642857143

In [566]:
onsite_avg

153273.66666666666

In [568]:
# comparison table

remote_salary_comparison = pd.DataFrame({
    'Work_Type': ['Remote', 'On-site'],
    'Average_Salary_USD': [remote_avg, onsite_avg]
})

In [570]:
remote_salary_comparison

  Work_Type  Average_Salary_USD
0    Remote       145065.964286
1   On-site       153273.666667

### Average Salary on an onsite work is more than the Average salary of a Remote work